{
    "title":"How to learn Javascript",
    "content":"Many free and paid courses and tutorials are available to learn JavaScript. For in-depth knowledge, you can also purchase a few good books like A Smarter Way to Learn JavaScript and Effective JavaScript: 68 Specific Ways to Harness the Power of JavaScript. However, to start working on projects, you need only a little theory and more hands-on, so we recommend you to take up tutorials and short courses that will get you onboard quickly.\n Below are the top 5 JavaScript tutorials: Javascript Tutorials:\n1) The Complete JavaScript Course 2020: Build Real Projects!: An introductory course that also covers some expert-level topics starts with JS fundamentals like variables, loops, control statements, and modern OOPS and goes on to explain the modern tools like Parcel, NPM, Babel, and ES6 modules. You will also learn about closures, higher-order functions, and other complex topics. The course is reasonably priced and offers 74 hours of on-demand video and lifetime access to the material.\n2) Front-end web developer: Nanodegree: This is a paid course of 4 months, which covers some advanced topics like Web API, asynchronous applications, etc. You should have fundamental knowledge of HTML, CSS, JavaScript to take up this course. You will get to do real-world projects with proper feedback and mentoring.\n3) Fullstack Javascript: If you want to be a full-stack JS developer, this is the right course for you. The course teaches JS from scratch. Once you are thorough with basics, you will also learn about AJAX, Asynchronous programming, Fetch API, Node.js, and the various ways to write JS applications outside the browser (like from command-line). Database concepts from SQL basics to using SQL ORMs with Node.js and building a simple CRUD application are also taught.\n4) Introduction to JavaScript | FreeCodeCamp: You can begin your learning curve through this free course, starting from scratch. It is well-paced and covers even the minute concepts that other courses will easily ignore. It follows a hands-on approach and covers lots of examples for developers to work on. This tutorial is an excellent example of learning by doing.\n5) The JavaScript Tutorial (javascript.info): Try this well-structured free tutorial that starts from scratch, right from setting up code editors, manuals and developer console, JS fundamentals, debugging, transpilers, and object-oriented concepts like ‘this’, references, ‘new’ operator, etc. to functions, stack, recursions, inheritance, prototype, and many more advanced concepts. The author provides simple examples to demonstrate each topic making learning easy for newbies.",
    "author":"Harshit",
    "slug":"how-to-learn-javascript"
}