{
    "title":"How to learn Machine Learning",
    "content":"According to Harvard Business Review, Data Scientist is the sexiest job of the 21st century. With exponential growth in the amount of data generated every day, the world needs specialists who can extract value from that data. Data science had a tremendous impact on many industries, but machine learning has always been a key driver to digital transformation and automatization. A career in machine learning might seem appealing, especially if you look at some facts: According to LinkedIn, artificial intelligence specialists took first place among the 15 fastest-growing jobs in the United States for 2020; Machine learning Engineer was on top of Indeed's list for the best jobs in the US in 2019; According to Indeed, Machine Learning Engineer job openings grew 344% between 2015 to 2018, and have an average base salary of $146,085. Machine learning is now everywhere around us: in music, healthcare, social networks, even in chess. The number of applications is huge, and it keeps getting bigger as more and more industries adopt this technology to tackle their problems. The demand for machine learning specialists is constantly growing. If you're not convinced about how widespread machine learning is, you can check out these examples of using artificial intelligence at some of the top companies to improve their operations, services and products. You will be pleasantly surprised. Being part of a rapidly growing artificial intelligence environment is an attractive career path, but how can you enter that path? You might have already heard that machine learning engineers are expected to be good at math and statistics, know programming languages, have a bit of business sense and solid research skills. It's all true, but don't let it overwhelm you. You don't have to be proficient in all of the above to start your career as a machine learning engineer. It takes time, effort, and practice to meet all of the qualifications.",
    "author":"Harshit",
    "slug":"how-to-learn-machine-learning"
}